; domain
(define (domain taco-filling)
  (:requirements :strips :typing)
  (:types
    ingredient tool appliance location dish
  )

  (:predicates
    ;;
    (at ?i - ingredient ?l - location)
    (at-tool ?t - tool ?l - location)
    (at-appliance ?a - appliance ?l - location)
    (at-dish ?d - dish ?l - location)

    ;;
    (cooked ?i - ingredient)
    (in-pan ?i - ingredient ?pan - tool)
    (in-dish ?i - ingredient ?d - dish)
    (heated ?pan - tool)
    (simmering ?pan - tool)
    (clean ?pan - tool)
    (drained ?pan - tool)
    (has-power ?a - appliance)
  )

  ;;   1：
  (:action brown_meat_and_onion
    :parameters (?meat - ingredient ?onion - ingredient ?pan - tool ?stove - appliance ?loc - location)
    :precondition (and
      (at ?meat ?loc)
      (at ?onion ?loc)
      (at-tool ?pan ?loc)
      (at-appliance ?stove ?loc)
      (has-power ?stove)
      (clean ?pan)
    )
    :effect (and
      (cooked ?meat)
      (cooked ?onion)
      (heated ?pan)
      (not (clean ?pan))
      (in-pan ?meat ?pan)
      (in-pan ?onion ?pan)
      (not (at ?meat ?loc))
      (not (at ?onion ?loc))
    )
  )

  ;;   2：
  (:action move_pan_to_sink
    :parameters (?pan - tool ?from - location ?to - location)
    :precondition (and
      (at-tool ?pan ?from)
    )
    :effect (and
      (at-tool ?pan ?to)
      (not (at-tool ?pan ?from))
    )
  )

  ;;   3：
  (:action drain_fat
    :parameters (?pan - tool)
    :precondition (and
      (heated ?pan)
      (at-tool ?pan sink_location)
    )
    :effect (and
      (drained ?pan)
    )
  )

  ;;   4：
  (:action move_pan_to_counter
    :parameters (?pan - tool ?from - location ?to - location)
    :precondition (and
      (at-tool ?pan ?from)
    )
    :effect (and
      (at-tool ?pan ?to)
      (not (at-tool ?pan ?from))
    )
  )

  ;;   5：
  (:action add_ingredients_and_simmer
    :parameters (?pan - tool ?ingredient1 - ingredient ?ingredient2 - ingredient ?stove - appliance ?loc - location)
    :precondition (and
      (drained ?pan)
      (at ?ingredient1 ?loc)
      (at ?ingredient2 ?loc)
      (at-tool ?pan ?loc)
      (at-appliance ?stove ?loc)
      (has-power ?stove)
    )
    :effect (and
      (in-pan ?ingredient1 ?pan)
      (in-pan ?ingredient2 ?pan)
      (cooked ?ingredient1)
      (cooked ?ingredient2)
      (simmering ?pan)
      (heated ?pan)
      (not (at ?ingredient1 ?loc))
      (not (at ?ingredient2 ?loc))
    )
  )

  ;;   6：
  (:action finish_preparation
    :parameters (?pan - tool ?dish - dish ?ingredients - ingredient ?loc - location)
    :precondition (and
      (simmering ?pan)
      (at-tool ?pan ?loc)
      (at-dish ?dish ?loc)
      (forall (?i - ingredient)
        (in-pan ?i ?pan))
    )
    :effect (and
      (forall (?i - ingredient)
        (and
          (in-dish ?i ?dish)
          (not (in-pan ?i ?pan))
        ))
      (not (simmering ?pan))
      (clean ?pan)
      (not (heated ?pan))
    )
  )
)

; problem
(define (problem make-taco-filling)
  (:domain taco-filling)

  (:objects
    ;;
    beef1 onion1 tomato1 spice1 - ingredient

    ;;
    pan1 - tool

    ;;
    stove1 - appliance

    ;;
    serving_dish1 - dish

    ;;
    kitchen_counter sink_location - location
  )

  (:init
    ;;
    (at beef1 kitchen_counter)
    (at onion1 kitchen_counter)
    (at tomato1 kitchen_counter)
    (at spice1 kitchen_counter)

    ;;
    (at-tool pan1 kitchen_counter)

    ;;
    (at-appliance stove1 kitchen_counter)
    (has-power stove1)

    ;;
    (at-dish serving_dish1 kitchen_counter)

    ;;
    (clean pan1)
    (not (heated pan1))
    (not (simmering pan1))
    (not (drained pan1))

    ;;
    (not (cooked beef1))
    (not (cooked onion1))
    (not (cooked tomato1))
    (not (cooked spice1))

    ;;
    (not (in-pan beef1 pan1))
    (not (in-pan onion1 pan1))
    (not (in-pan tomato1 pan1))
    (not (in-pan spice1 pan1))
  )

  (:goal
    (and
      ;;
      (cooked beef1)
      (cooked onion1)
      (cooked tomato1)
      (cooked spice1)

      (in-dish beef1 serving_dish1)
      (in-dish onion1 serving_dish1)
      (in-dish tomato1 serving_dish1)
      (in-dish spice1 serving_dish1)

      ;;
      (clean pan1)
      (not (heated pan1))
      (not (simmering pan1))

      ;;
      (drained pan1)
    )
  )
)

; plan
1. (brown_meat_and_onion beef1 onion1 pan1 stove1 kitchen_counter)
   deleted: (clean pan1) (at beef1 kitchen_counter) (at onion1 kitchen_counter)
   added: (cooked beef1) (cooked onion1) (heated pan1) (in-pan beef1 pan1) (in-pan onion1 pan1)
   goals met: 3 of 12
2. (move_pan_to_counter pan1 kitchen_counter sink_location)
   deleted: (at-tool pan1 kitchen_counter)
   added: (at-tool pan1 sink_location)
   goals met: 3 of 12
3. (drain_fat pan1)
   added: (drained pan1)
   goals met: 4 of 12
4. (move_pan_to_counter pan1 sink_location kitchen_counter)
   deleted: (at-tool pan1 sink_location)
   added: (at-tool pan1 kitchen_counter)
   goals met: 4 of 12
5. (add_ingredients_and_simmer pan1 spice1 tomato1 stove1 kitchen_counter)
   deleted: (at spice1 kitchen_counter) (at tomato1 kitchen_counter)
   added: (in-pan spice1 pan1) (in-pan tomato1 pan1) (cooked spice1) (cooked tomato1) (simmering pan1)
   goals met: 5 of 12
6. (finish_preparation pan1 serving_dish1 beef1 kitchen_counter)
   deleted: (in-pan beef1 pan1) (in-pan onion1 pan1) (in-pan tomato1 pan1) (in-pan spice1 pan1) (simmering pan1) (heated pan1)
   added: (in-dish beef1 serving_dish1) (in-dish onion1 serving_dish1) (in-dish tomato1 serving_dish1) (in-dish spice1 serving_dish1) (clean pan1)
   goals met: 12 of 12
